02_openfoam/baseline_SST/NACA4412_AoA00/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (15 0 0);

boundaryField
{
    airfoil
    {
        type            noSlip;
    }

    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (15 0 0);
    }

    top
    {
        type            freestreamVelocity;
        freestreamValue uniform (15 0 0);
    }

    bottom
    {
        type            freestreamVelocity;
        freestreamValue uniform (15 0 0);
    }

    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (15 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}
