02_openfoam/baseline_SST/NACA4412_AoA00/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 1;
    }

    inlet
    {
        type            freestream;
        freestreamValue uniform 1;
    }

    top
    {
        type            freestream;
        freestreamValue uniform 1;
    }

    bottom
    {
        type            freestream;
        freestreamValue uniform 1;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 1;
    }

    frontAndBack
    {
        type            empty;
    }
}
